emacs.org
#+TITLE: emacs.org
#+AUTHOR: Andre Pascal Beyer
#+DATE: 2013-12-20

* Globals, Functions and Settings
** Globals
#+begin_src emacs-lisp :tangle emacs.el
(require 'eldoc)

(prefer-coding-system 'utf-8)

(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq inhibit-startup-echo-area-message t)
(setq inhibit-startup-message t)

(defun add-to-load-path (path)
  "Wrapps the ADD-TO-LIST function for the LOAD-PATH variable"
  (add-to-list 'load-path path))

(defun add-theme (path)
  "Wrapps the ADD-TO-LIST function for the CUSTOM-THEME-LOAD-PATH variable"
  (add-to-list 'custom-theme-load-path (format "~/.emacs.d/color-theme/%s"
					       path)))

(defun add-to-alist (suffix-mode-list)
  "Wrapps the ADD-TO-LIST function for the AUTO-MODE-ALIST variable"
  (add-to-list 'auto-mode-alist suffix-mode-list))

(mapc #'load (directory-files "~/.emacs.d/src/" t "\\.el$"))

(add-to-load-path "~/.emacs.d/src/")
#+end_src
** Macros
#+begin_src emacs-lisp :tangle src/functions.el
(defmacro with-module (symbol name-string &rest body)
  `(condition-case nil
       (progn
         (add-to-load-path  ,(format "%s%s" *modules-dir* name-string))
         (autoload ',symbol ,name-string ,name-string t)
         ,@body)
     
     (error (message (format " => problem loading %s" ',symbol))
            nil)))

(defmacro with-library (symbol &rest body)
  `(condition-case nil
       (progn
         (add-to-load-path ,(format "%s%s" *modules-dir* symbol))
         (require ',symbol)
         ,@body)))
#+end_src
** Settings
#+begin_src emacs-lisp :tangle src/settings.el
(put 'with-module 'lisp-indent-function 1)

(defun pretty-lambdas ()
  (font-lock-add-keywords
   nil `(("(\\(lambda\\>\\)"
          (0 (progn (compose-region (match-beginning 1) (match-end 1)
                                    ,(make-char 'greek-iso8859-7 107))
                    nil))))))

(font-lock-add-keywords 'emacs-lisp-mode
                        '(("(\\(lambda\\)\\>" (0 (prog1 ()
                                              (compose-region (match-beginning 1)
                                                              (match-end 1)
                                                              λ))))))

(font-lock-add-keywords 'python
                        '(("lambda" (0 (prog1 ()
                                         (compose-region (match-beginning 1)
                                                         (match-end 1)
                                                         λ))))))
#+end_src
* Modes
** darcs
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; darcsum
;;

(with-library darcsum)
#+end_src
** magit
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; magit
;;

;; (eval-after-load 'info
;;  '(progn (info-initialize)
;;          (add-to-list 'Info-directory-list "~/.emacs.d/modules/magit/")))

;; (with-library git-commit-mode)
;; (with-library magit)

#+end_src
** paredit
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; paredit
;;
(defun add-paredit (mode)
  "Wrapps the function used for adding paredit to mode hooks"
  (add-hook mode #'enable-paredit-mode))

(with-module enable-paredit-mode "paredit"
             (add-paredit 'emacs-lisp-mode)
             (add-paredit 'eval-expression-minibuffer-setup-hook)
             (add-paredit 'ielm-mode-hook)
             (add-paredit 'lisp-mode-hook)
             (add-paredit 'lisp-interaction-mode-hook)
             (add-paredit 'scheme-mode-hook)
             (add-paredit 'python-mode-hook))

(eldoc-add-command
 'paredit-backward-delete
 'paredit-close-round)

#+end_src
** xml-parse
#+begin_src emacs-lisp
;;
;; xml-parse
;;

;; (with-library xml-parse)

#+end_src
** powerline
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; powerline
;;
;; (with-library powerline
;;              (powerline-center-theme))

#+end_src
** org-settings
*** ess
#+begin_src emacs-lisp :tangle src/myorg.el
;; (require 'ox-beamer)

;;
;; ess
;;
(add-to-list 'load-path "~/.emacs.d/modules/ess-site/lisp")
(require 'ess-site)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)
   (python . t)
   (latex . t)
   (haskell . t)
   (emacs-lisp . t)
   (ruby . t)
   (sh . t)
   (lisp . t)
   (octave . t)
   (octave . t)))

(add-hook 'inferior-octave-mode-hook
          '(lambda ()
             (setq inferior-octave-program
                   "C:\\cygwin\\usr\\bin\\octave.exe")))

;; (setq org-babel-R-command "c:/Program\ Files/R/R-3.0.2/bin/x64/Rterm.exe --slave --no-save")

;;
;; latex
;;
(add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
(server-start)

#+end_src
