src/myorg.el

;; (require 'ox-beamer)

;;
;; ess
;;
(add-to-list 'load-path "~/.emacs.d/modules/ess-site/lisp")
(require 'ess-site)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)
   (python . t)
   (latex . t)
   (haskell . t)
   (emacs-lisp . t)
   (ruby . t)
   (sh . t)
   (lisp . t)
   (octave . t)
   (octave . t)))

(add-hook 'inferior-octave-mode-hook
          '(lambda ()
             (setq inferior-octave-program
                   "C:\\cygwin\\usr\\bin\\octave.exe")))

;; (setq org-babel-R-command "c:/Program\ Files/R/R-3.0.2/bin/x64/Rterm.exe --slave --no-save")

;;
;; latex
;;
(add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
(server-start)
