emacs.org
*** organize
#+begin_src emacs-lisp :tangle "src/organize.el"
;;
;; using org mode as organzier
;;
(add-to-alist '("\\.\\(org\\|org_archive\\)$" . org-mode))

(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)
(global-set-key "\C-cc" 'org-capture)

(defvar *todo* "~/planer/todo.org")
(defvar *notes* "~/planer/notes.org")
(defvar *calendar* "~/planer/calendar.org")

(setq org-agenda-files (list *todo* *calendar*))

(setq org-capture-templates
        '(("t" "Task" entry (file+headline *todo* "Inbox")
           "* TODO %? \n  %i" :clock-in t :clock-resume t)
          ("n" "Retailiate" entry (file+headline *todo* "Retailiate")
           "* LOOK %? \n  %i" :clock-in t :clock-resume t)
          ("r" "Read" entry (file+headline *todo* "Read")
           "* READ %? \n  %i" :clock-in t :clock-resume t)
          ("j" "Notes" entry (file+datatree *notes*)
           "* %?\nEntered on %U\n  %i")
          ("d" "Dates" entry (file+datatree *calendar*)
           "* DATE %? \n  %i" :clock-in t :clock-resume t)))

(setq org-hide-leading-stars 'hidestars)
(setq org-return-follows-link t)
(setq org-completion-use-ido t)
(setq org-refile-use-outline-path (quote file))
(setq org-outline-path-complete-in-steps t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)
(setq org-drawers (quote ("PROPERTIES" "CLOCKTABLE" "LOGBOOK" "CLOCK")))
(setq org-use-fast-todo-selection t)
(setq org-todo-keywords
      '((sequence "TODO(t)" "STARTED(s!)" "FINISHED(s!)" "LOOK(n)" "SEEN(m!)" 
                  "READ(r)" "DONE(q!)" "DATE(d)" "DELEGATED(c)" "CANCELED(b)")))
(setq org-todo-keyword-faces
      '(("TODO"  . (:foreground "#b70101" :weight bold))
        ("STARTED"  . (:foreground "#b70101" :weight bold))
        ("LOOK"  . (:foreground "sienna" :weight bold))
        ("SEEN"  . (:foreground "blue" :weight bold))
        ("READ"  . (:foreground "orange" :weight bold))
        ("DATE"  . (:foreground "orange" :weight bold))
        ("DONE"  . (:foreground "forestgreen" :weight bold))
        ("DELEGATED"  . (:foreground "forestgreen" :weight bold))
        ("CANCELED"  . shadow)))

;;
;; agenda
;;
;;(add-hook 'org-agenda-mode-hook '(lambda () (h1-line-mode 1)))
(setq org-agenda-format-date 
 "%Y-%m-%d ---------------------------------------------------------------------")
(setq org-agenda-fontify-priorities 
      '((65 (:foreground "Red")) 
        (66 (:foreground "Blue")) 
        (67 (:foreground "Darkgreen"))))

(setq org-agenda-date-weekend '(:foreground "Yellow" :weight bold))

(setq org-agenda-skip-deadline-if-done t)
(setq org-agenda-skip-scheduled-if-done t)
(setq org-agenda-span 1)


#+end_src
*** mobile org
#+begin_src emacs-lisp :tangle src/myorg.el
;; Set to the location of your Org files on your local system
(setq org-directory "G:/Dropbox/org/org")
;; Set to <your Dropbox root directory>/MobileOrg.
(setq org-mobile-directory "G:/Dropbox/org/mobile")
;; Set to the files (or directory of files) you want sync'd
(setq org-agenda-files '("G:/Dropbox/org/org"))
;; Set to the name of the file where new notes will be stored
(setq org-mobile-inbox-for-pull "G:/Dropbox/org/org/from-mobile.org")

#+end_src
** languages
*** perl
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; perl
;;

;; (with-library sepia
;;               (setq sepia-perl5lib (list (expand-file-name "~/.emacs.d/modules/sepia/lib")))
;;               (defalias 'perl-mode 'sepia-mode))

#+end_src
*** chicken
#+begin_src emacs-lisp :tangle src/modules.el
(require 'autoinsert)
(add-hook 'find-file-hooks 'auto-insert)

(setq auto-insert-alist
      '(("\\.scm" .
         (insert "#!/bin/sh\n# -*- scheme -*-\nexec csi -s $0 \"$@\"\n\n"))))

(setf scheme-program-name "csi")
#+end_src
*** haskell
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; haskell mode
;;
(with-library haskell-mode
              (require 'haskell-mode-autoloads)
              (add-to-list 'Info-default-directory-list "~/.emacs.d/modules/haskell-mode/")

              (add-to-alist '("\\.\\(hs\\|lhs\\)$" . org-mode))

              (add-hook 'haskell-mode-hook 'turn-on-haskell-indent))


#+end_src
*** lisp
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; lisp
;;
(setq inferior-lisp-program (case system-type
                                  ((windows-nt cygwin) "c:/ccl/wx86cl -K utf-8")))

#+end_src
*** clojure
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; clojure
;;

(with-library clojure-mode
              (add-to-alist '("\\.\\(clj\\)$" . clojure-mode)))

;;
;; needed for cider
;;
(with-library epl)
(with-library dash)
(with-library pkg-info)

(with-library cider
              (add-hook 'cider-mode-hook 'cider-turn-on-eldoc-mode)
              (setq nrepl-hide-special-buffers t)
              (setq cider-repl-pop-to-buffer-on-connect nil)
              (setq cider-repl-results-prefix ";; => "))

#+end_src
*** julia
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; julia
;;

(with-library julia-mode)

#+end_src

*** APL
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; APL
;;

(add-to-list 'load-path "~/.emacs.d/modules/apl")

(when (require 'gnu-apl-mode nil t)
  (dolist (hook '(gnu-apl-mode-hook gnu-apl-interactive-mode-hook))
    (add-hook hook (lambda ()
                     (eldoc-mode)
                     (setq buffer-face-mode-face 'gnu-apl-default)
                     (buffer-face-mode))))
  (set-face-attribute 'gnu-apl-default nil
                      :family "DejaVu Sans Mono")
  (add-to-list 'auto-mode-alist '("\\.apl$" . gnu-apl-mode)))

(setq gnu-apl-show-keymap-on-startup t)

(add-hook 'gnu-apl-interactive-mode-hook 
          '(lambda ()
             (setq buffer-face-mode 'gnu-apl-default)
             (buffer-face-mode)))

#+end_src
** jedi
#+begin_src emacs-lisp :tangle src/modules
;;
;; jedi
;;

(with-library popup)
(with-library auto-complete)
(with-library ctable)
(with-library deferred)
(with-library epc)

(with-library jedi
              (add-hook 'python-mode-hook 'jedi:setup)
              (setq jedi:setup-keys t)
              (setq jedi:complet-on-dot t))
#+end_src
* Eyecandy
#+begin_src emacs-lisp :tangle "src/eyecandy.el"
;;
;; color theme
;;

;; (add-theme "sunburst")
;; (load-theme 'sunburst t)
;; (add-theme "monokai")
;; (load-theme 'monokai t)
(add-to-list 'load-path  "~/.emacs.d/color-theme/tomorrow")
(require 'color-theme-sanityinc-tomorrow)
(color-theme-sanityinc-tomorrow-bright)


;;
;; hud
;;
(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)
(global-visual-line-mode 1)
(show-paren-mode 1)
(global-hl-line-mode 1)
(setq inhibit-splash-screen t)
(setq visible-bell t)

;;
;; font
;;
(set-face-attribute 'default nil :font "Andale Mono-9")
;; (set-default-font "Droid Sans Mono-9")
#+end_src

* Tasks [0%]
** DONE [#A] haskell
** DONE [#A] darcs support?
   :LOGBOOK:
   - State "DONE"       from "READ"       [2014-05-27 Di 18:08]
   - State "SEEN"       from "LOOK"       [2014-05-27 Di 18:08]
   - State "FINISHED"   from "STARTED"    [2014-05-27 Di 18:08]
   - State "STARTED"    from "TODO"       [2014-05-27 Di 18:08]
   :END:
** TODO [#A] time stamp
** DONE [#A] perl mode
** TODO [#A] slime
** DONE [#C] clojure?
** TODO [#C] prolog
** TODO [#B] shen
