src/myorg.el

;; Set to the location of your Org files on your local system
(setq org-directory "G:/Dropbox/org/org")
;; Set to <your Dropbox root directory>/MobileOrg.
(setq org-mobile-directory "G:/Dropbox/org/mobile")
;; Set to the files (or directory of files) you want sync'd
(setq org-agenda-files '("G:/Dropbox/org/org"))
;; Set to the name of the file where new notes will be stored
(setq org-mobile-inbox-for-pull "G:/Dropbox/org/org/from-mobile.org")
